#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```
Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```
terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.repository_rust_svc["assets"].github_repository_file.files[".dockerignore"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "develop"
      + commit_message      = <<-EOT
            fixup! ci: terraform provisioned file changes
            
            [skip ci]
        EOT
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            target/
        EOT
      + file                = ".dockerignore"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + ref                 = (known after apply)
      + repository          = "svc-assets"
      + sha                 = (known after apply)
    }

  # module.repository_rust_svc["atc"].github_repository_file.files[".dockerignore"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "develop"
      + commit_message      = <<-EOT
            fixup! ci: terraform provisioned file changes
            
            [skip ci]
        EOT
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            target/
        EOT
      + file                = ".dockerignore"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + ref                 = (known after apply)
      + repository          = "svc-atc"
      + sha                 = (known after apply)
    }

  # module.repository_rust_svc["cargo"].github_repository_file.files[".dockerignore"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "develop"
      + commit_message      = <<-EOT
            fixup! ci: terraform provisioned file changes
            
            [skip ci]
        EOT
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            target/
        EOT
      + file                = ".dockerignore"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + ref                 = (known after apply)
      + repository          = "svc-cargo"
      + sha                 = (known after apply)
    }

  # module.repository_rust_svc["compliance"].github_repository_file.files[".dockerignore"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "develop"
      + commit_message      = <<-EOT
            fixup! ci: terraform provisioned file changes
            
            [skip ci]
        EOT
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            target/
        EOT
      + file                = ".dockerignore"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + ref                 = (known after apply)
      + repository          = "svc-compliance"
      + sha                 = (known after apply)
    }

  # module.repository_rust_svc["contact"].github_repository_file.files[".dockerignore"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "develop"
      + commit_message      = <<-EOT
            fixup! ci: terraform provisioned file changes
            
            [skip ci]
        EOT
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            target/
        EOT
      + file                = ".dockerignore"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + ref                 = (known after apply)
      + repository          = "svc-contact"
      + sha                 = (known after apply)
    }

  # module.repository_rust_svc["devops-test"].github_repository_file.files[".dockerignore"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "develop"
      + commit_message      = <<-EOT
            fixup! ci: terraform provisioned file changes
            
            [skip ci]
        EOT
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            target/
        EOT
      + file                = ".dockerignore"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + ref                 = (known after apply)
      + repository          = "svc-devops-test"
      + sha                 = (known after apply)
    }

  # module.repository_rust_svc["discovery"].github_repository_file.files[".dockerignore"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "develop"
      + commit_message      = <<-EOT
            fixup! ci: terraform provisioned file changes
            
            [skip ci]
        EOT
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            target/
        EOT
      + file                = ".dockerignore"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + ref                 = (known after apply)
      + repository          = "svc-discovery"
      + sha                 = (known after apply)
    }

  # module.repository_rust_svc["docs"].github_repository_file.files[".dockerignore"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "develop"
      + commit_message      = <<-EOT
            fixup! ci: terraform provisioned file changes
            
            [skip ci]
        EOT
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            target/
        EOT
      + file                = ".dockerignore"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + ref                 = (known after apply)
      + repository          = "svc-docs"
      + sha                 = (known after apply)
    }

  # module.repository_rust_svc["pricing"].github_repository_file.files[".dockerignore"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "develop"
      + commit_message      = <<-EOT
            fixup! ci: terraform provisioned file changes
            
            [skip ci]
        EOT
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            target/
        EOT
      + file                = ".dockerignore"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + ref                 = (known after apply)
      + repository          = "svc-pricing"
      + sha                 = (known after apply)
    }

  # module.repository_rust_svc["scheduler"].github_repository_file.files[".dockerignore"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "develop"
      + commit_message      = <<-EOT
            fixup! ci: terraform provisioned file changes
            
            [skip ci]
        EOT
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            target/
        EOT
      + file                = ".dockerignore"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + ref                 = (known after apply)
      + repository          = "svc-scheduler"
      + sha                 = (known after apply)
    }

  # module.repository_rust_svc["storage"].github_repository_file.files[".dockerignore"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "develop"
      + commit_message      = <<-EOT
            fixup! ci: terraform provisioned file changes
            
            [skip ci]
        EOT
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            target/
        EOT
      + file                = ".dockerignore"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + ref                 = (known after apply)
      + repository          = "svc-storage"
      + sha                 = (known after apply)
    }

  # module.repository_rust_svc["telemetry"].github_repository_file.files[".dockerignore"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "develop"
      + commit_message      = <<-EOT
            fixup! ci: terraform provisioned file changes
            
            [skip ci]
        EOT
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            target/
        EOT
      + file                = ".dockerignore"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + ref                 = (known after apply)
      + repository          = "svc-telemetry"
      + sha                 = (known after apply)
    }

  # module.repository_svc_template["rust"].github_repository_file.files[".dockerignore"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "develop"
      + commit_message      = <<-EOT
            fixup! ci: terraform provisioned file changes
            
            [skip ci]
        EOT
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            target/
        EOT
      + file                = ".dockerignore"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + ref                 = (known after apply)
      + repository          = "svc-template-rust"
      + sha                 = (known after apply)
    }

  # module.repository_tf["onboarding"].github_repository_file.files[".github/workflows/terraform.yml"] will be updated in-place
  ~ resource "github_repository_file" "files" {
      ~ content             = <<-EOT
            ## DO NOT EDIT!
            ### This file was provisioned by Terraform
            ### File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/tf-onboarding/.github/workflows/terraform.yml
            
            name: "Terraform"
            
            on:
              push:
                branches:
                  - main
              pull_request:
            
            env:
              GITHUB_APP_PEM_FILE: ${{ secrets.TF_GITHUB_APP_PEM_FILE }}
          -   TF_VERSION: 1.3.7
          +   TF_VERSION: 1.4.5
            
            jobs:
              terraform:
                name: "Terraform"
                runs-on: ubuntu-latest
                permissions:
                  issues: write
                  pull-requests: write
                  contents: read
                  id-token: write
            
                defaults:
                  run:
                    working-directory: src
                concurrency:
                  group: terraform-${{ github.head_ref || 'main' }}
                steps:
                  - name: Checkout
                    uses: actions/checkout@v3
            
                  - name: Authenticate with Google Cloud
                    uses: google-github-actions/auth@v1
                    with:
                      workload_identity_provider: ${{ secrets.GOOGLE_WORKLOAD_IDENTITY_POOL }}
                      service_account: ${{ secrets.GOOGLE_TERRAFORM_SA }}
            
                  - name: Configure AWS Credentials
                    uses: aws-actions/configure-aws-credentials@v1
                    with:
                      role-to-assume: "arn:aws:iam::${{ secrets.AWS_IAM_ACCOUNT_ID }}:role/all-GitHubActionsOnboarding"
                      role-session-name: arrow-onboarding-terraform
                      aws-region: "us-east-1"
            
                  - name: JSON Syntax check
                    uses: limitusus/json-syntax-check@v1
                    with:
                      pattern: "\\.json$"
            
                  - name: Setup Terraform
                    uses: hashicorp/setup-terraform@v2
                    with:
                      cli_config_credentials_token: ${{ secrets.TF_CLOUD_TOKEN }}
                      terraform_version: ${{ env.TF_VERSION }}
            
                  - name: Terraform Format
                    id: fmt
                    run: terraform fmt -check
            
                  - name: Terraform Init
                    id: init
                    run: terraform init
            
                  - name: Terraform Validate
                    id: validate
                    run: terraform validate -no-color
            
                  - name: Terraform Plan
                    id: plan
                    if: github.event_name == 'pull_request'
                    run: |
                      terraform plan -no-color -lock=false -input=false -out tf.plan
                    continue-on-error: true
            
                  - name: Terraform Plan Show
                    id: planshow
                    if: github.event_name == 'pull_request'
                    run: |
                      terraform show -no-color tf.plan
            
                  - name: Add PR comment with plan output
                    uses: actions/github-script@v6
                    if: github.event_name == 'pull_request'
                    env:
                      PLAN: "terraform\n${{ steps.planshow.outputs.stdout }}"
                    with:
                      github-token: ${{ secrets.GITHUB_TOKEN }}
                      script: |
                        // 1. Retrieve existing bot comments for the PR
                        const { data: comments } = await github.rest.issues.listComments({
                          owner: context.repo.owner,
                          repo: context.repo.repo,
                          issue_number: context.issue.number,
                        })
                        const botComment = comments.find(comment => {
                          return comment.user.type === 'Bot' && comment.body.includes('Terraform Format and Style')
                        })
            
                        // 2. Prepare format of the comment
                        const output = `#### Terraform Format and Style 🖌 \`${{ steps.fmt.outcome }}\`
                        #### Terraform Initialization ⚙\`${{ steps.init.outcome }}\`
                        #### Terraform Validation 🤖\`${{ steps.validate.outcome }}\`
                        <details><summary>Validation Output</summary>
            
                        \`\`\`
                        ${{ steps.validate.outputs.stdout }}
                        \`\`\`
            
                        </details>
            
                        #### Terraform Plan 📖\`${{ steps.plan.outcome }}\`
            
                        <details><summary>Show Plan</summary>
            
                        \`\`\`
                        ${process.env.PLAN}
                        \`\`\`
            
                        </details>
            
                        *Pusher: @${{ github.actor }}, Action: \`${{ github.event_name }}\`, Working Directory: \`${{ env.tf_actions_working_dir }}\`, Workflow: \`${{ github.workflow }}\`*`;
            
                        // 3. If we have a comment, update it, otherwise create a new one
                        if (botComment) {
                          github.rest.issues.updateComment({
                            owner: context.repo.owner,
                            repo: context.repo.repo,
                            comment_id: botComment.id,
                            body: output
                          })
                        } else {
                          github.rest.issues.createComment({
                            issue_number: context.issue.number,
                            owner: context.repo.owner,
                            repo: context.repo.repo,
                            body: output
                          })
                        }
                  - name: Terraform Plan Status
                    if: steps.plan.outcome == 'failure' && !contains(github.event.head_commit.message, 'provisioned by terraform')
                    run: exit 1
            
                  - name: Terraform Apply
                    if: github.ref == 'refs/heads/main' && github.event_name == 'push' && !contains(github.event.head_commit.message, 'provisioned by terraform')
                    run: terraform apply -auto-approve -input=false
        EOT
        id                  = "tf-onboarding/.github/workflows/terraform.yml"
        # (8 unchanged attributes hidden)
    }

  # module.repository_tf["onboarding"].github_repository_file.files[".make/env.mk"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "main"
      + commit_message      = <<-EOT
            fixup! ci: terraform provisioned file changes
            
            [skip ci]
        EOT
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
            # File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/all/.make/env.mk
            
            ENV_FILE := $(wildcard .env .env.base)
            # If .env is missing, install .env.base+.env.repo as .env and load that.
            ifeq ($(ENV_FILE),.env.base)
            $(warning Settings file '.env' missing: '$(ENV_FILE)' => installing .env as merge of .env.base + .env.repo!)
            $(shell cat .env.base .env.repo > .env 2>/dev/null)
            endif
            
            # Sanity check, make sure keys from base and repo are present.
            # Strip empty lines and comments, get sorted keys (e.g. DOCKER_NAME)
            ENV_KEYS=$(shell grep -Ehv '^\s*(\#.*)?\s*$$' .env.base .env.repo 2>/dev/null | cut -f1 -d= | sort)
            # Check if key exists in .env, if not grep it from the .env.base/repo into your .env
            $(foreach k, $(ENV_KEYS), $(eval $(shell sh -c "grep -q '^$(k)=' .env 2>/dev/null || (echo '*** NOTE: Adding missing .env key [$(k)] to your .env file!' 1>&2 ; grep -h '^$(k)=' .env.base .env.repo 2>/dev/null >> .env ; grep '^$(k)=' .env 1>&2)")))
            
            -include $(ENV_FILE)
        EOT
      + file                = ".make/env.mk"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + ref                 = (known after apply)
      + repository          = "tf-onboarding"
      + sha                 = (known after apply)
    }

  # module.repository_tf["onboarding"].github_repository_file.files[".make/terraform.mk"] will be updated in-place
  ~ resource "github_repository_file" "files" {
      ~ content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
            # File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/all/.make/terraform.mk
            
            # GCP required vars
            GOOGLE_IMPERSONATE_SERVICE_ACCOUNT ?= tf-ro-${TF_WORKSPACE}-${TF_PROJECT}@${TF_PREFIX}-${TF_WORKSPACE}-${TF_PROJECT}.iam.gserviceaccount.com
            GOOGLE_APPLICATION_CREDENTIALS     ?= $(HOME)/.config/gcloud/application_default_credentials.json
            
            # Terraform required vars
            TF_STATE_BUCKET ?= ${TF_PREFIX}-${TF_WORKSPACE}-${TF_PROJECT}-tfstate
            TF_IMAGE_NAME   ?= ghcr.io/arrow-air/tools/arrow-tfenv
            TF_IMAGE_TAG    ?= 3.0.0-v1.4.2-1
            TF_WORKSPACE    ?= default
            TF_FLAGS        ?=
            TF_STDOUT       ?= &1
          + TF_SOURCE_PATH  ?= $(SOURCE_PATH)/src
            
          - TF_STATE_FILE := $(SOURCE_PATH)/src/.terraform/terraform.tfstate
          + TF_STATE_FILE := $(TF_SOURCE_PATH)/.terraform/terraform.tfstate
            JQ            := $(shell command -v jq 2> /dev/null)
            ifneq ("$(wildcard $(TF_STATE_FILE))","")
            	ifdef JQ
            		CONFIGURED_STATE_BUCKET := $(shell jq -r '.backend.config.bucket' < ${TF_STATE_FILE})
            		CONFIGURED_BACKEND_TYPE := $(shell jq -r '.backend.type' < ${TF_STATE_FILE})
            	endif
            endif
            
            TF_STATE_BUCKET = $(TF_PREFIX)-$(*)-$(TF_PROJECT)-tfstate
            
            # function with a generic template to run docker with the required values
            # Accepts $1 = command to run, $2 = additional command flags (optional)
            tf_run = docker run \
            	--name=${DOCKER_NAME}-$@ \
            	--workdir=/opt/ \
            	--rm \
            	--user `id -u`:`id -g` \
          - 	-v "${SOURCE_PATH}/src/:/opt/" \
          + 	-v "${TF_SOURCE_PATH}:/opt/" \
            	-v "${GOOGLE_APPLICATION_CREDENTIALS}:/tmp/credentials.json" \
            	-e "GOOGLE_APPLICATION_CREDENTIALS=/tmp/credentials.json" \
            	-e "GOOGLE_IMPERSONATE_SERVICE_ACCOUNT=${GOOGLE_IMPERSONATE_SERVICE_ACCOUNT}" \
            	-e "PLAN_FILE=plan-${TF_WORKSPACE}.tfplan" \
            	-e "TF_IN_AUTOMATION=true" \
            	-e "TF_WORKSPACE=${TF_WORKSPACE}" \
            	-e "TF_STATE_BUCKET=${TF_STATE_BUCKET}" \
            	-e "TF_VAR_tf_project=${TF_PROJECT}" \
            	-t ${TF_IMAGE_NAME}:${TF_IMAGE_TAG} \
            	$(1) $(2) 1>$(TF_STDOUT)
            
            # function to call init and providing a reason why init is needed
            define run_init
            	echo "$(YELLOW)$(1)$(SGR0)" && $(call tf_run,init,-backend-config="bucket=$(TF_STATE_BUCKET)" -upgrade)
            endef
            
            # Check if we need to run init, call_init when needed
            ifeq ("$(wildcard $(TF_STATE_FILE))", "")
            define check_init
            	$(call run_init,(No state file found, need init))
            endef
            else
            	ifdef JQ
            define check_init
            	$(if $(filter "$(CONFIGURED_BACKEND_TYPE)","local"),$(call run_init,(State file $(CONFIGURED_BACKEND_TYPE), always run init)),$(if $(filter "$(CONFIGURED_STATE_BUCKET)","$(TF_STATE_BUCKET)"),(echo "$(GREEN)Init already done, no need to run init again$(SGR0)"), $(call run_init,(Backend bucket mismatch in jq test (\"${CONFIGURED_STATE_BUCKET}\" != \"${TF_STATE_BUCKET}\"), need to run init))))
            endef
            	else
            define check_init
            	$(if $(shell grep bucket "${TF_STATE_FILE}" | grep -q -- ${TF_STATE_BUCKET} && echo $?) != 0,$(call run_init,(Backend bucket mismatch in grep test)))
            endef
            	endif
            endif
            
            tf-docker-pull:
            	@echo docker pull -q $(TF_IMAGE_NAME):$(TF_IMAGE_TAG)
            
            .help-tf:
            	@echo ""
            	@echo "$(SMUL)$(BOLD)$(GREEN)Terraform$(SGR0)"
            	@echo "  $(BOLD)tf-clean$(SGR0)       -- Run 'rm -rf src/.terraform'"
            	@echo "  $(BOLD)tf-init-ARG$(SGR0)    -- Run 'TF_WORKSPACE=ARG terraform init'"
            	@echo "  $(BOLD)tf-validate-ARG$(SGR0)-- Run 'TF_WORKSPACE=ARG terraform validate ${TF_FLAGS}'"
            	@echo "  $(BOLD)tf-plan-ARG$(SGR0)    -- Run 'TF_WORKSPACE=ARG terraform plan ${TF_FLAGS}'"
            	@echo "  $(BOLD)tf-show-ARG$(SGR0)    -- Run 'TF_WORKSPACE=ARG terraform show ${TF_FLAGS}' to show the plan output."
            	@echo "  $(BOLD)tf-workspaces$(SGR0)  -- Run 'terraform workspace list' to list the available workspaces."
            	@echo "  $(BOLD)tf-fmt$(SGR0)         -- Run 'terraform fmt -check -recursive' to check terraform file formats."
            	@echo "  $(BOLD)tf-tidy$(SGR0)        -- Run 'terraform fmt -recursive' to fix terraform file formats if needed."
            	@echo "  $(CYAN)Combined targets$(SGR0)"
            	@echo "  $(BOLD)tf-all$(SGR0)         -- Run targets; tf-clean tf-fmt"
            
            .SILENT: tf-docker-pull
            
            tf-clean: tf-docker-pull
            	@echo "$(CYAN)Removing .terraform directory...$(SGR0)"
            	@rm -rf ./src/.terraform
            
            tf-init-%: TF_WORKSPACE=$*
            tf-init-%: tf-docker-pull
            	@echo "$(CYAN)Running terraform init...$(SGR0)"
            	@$(call tf_run,init,-backend-config="bucket=$(TF_STATE_BUCKET)" -upgrade)
            
            tf-validate-%: TF_WORKSPACE=$*
            tf-validate-%: tf-docker-pull
            	@$(call check_init)
            	@echo "$(CYAN)Running terraform validate...$(SGR0)"
            	@$(call tf_run,validate,$(TF_FLAGS))
            
            tf-plan-%: TF_FLAGS=-lock=false -out $(TF_WORKSPACE).plan
            tf-plan-%: TF_WORKSPACE=$*
            tf-plan-%: tf-docker-pull
            	@$(call check_init)
            	@echo "$(CYAN)Running terraform plan...$(SGR0)"
            	@$(call tf_run,plan,$(TF_FLAGS))
            
            tf-show-%: TF_WORKSPACE=$*
            tf-show-%: tf-docker-pull
            	@echo "$(CYAN)Running terraform show...$(SGR0)"
            	@$(call tf_run,show,$(TF_FLAGS) $(TF_WORKSPACE).plan)
            
            tf-apply-%: TF_WORKSPACE=$*
            tf-apply-%: GOOGLE_IMPERSONATE_SERVICE_ACCOUNT=tf-${TF_WORKSPACE}-${TF_PROJECT}@${TF_PREFIX}-${TF_WORKSPACE}-${TF_PROJECT}.iam.gserviceaccount.com
            tf-apply-%: tf-docker-pull
            	@echo "$(CYAN)Running terraform apply...$(SGR0)"
            	@$(call tf_run,apply,$(TF_FLAGS) $(TF_WORKSPACE).plan)
            
            tf-workspaces: tf-docker-pull
            	@echo "$(CYAN)Running terraform workspace list...$(SGR0)"
            	@$(call tf_run,workspace,list)
            
            tf-fmt: tf-docker-pull
            	@echo "$(CYAN)Running and checking terraform file formats...$(SGR0)"
            	@$(call tf_run,fmt,-check -recursive)
            
            tf-tidy: tf-docker-pull
            	@echo "$(CYAN)Running terraform file formatting fixes...$(SGR0)"
            	@$(call tf_run,fmt,-recursive)
            
            tf-all: tf-clean tf-fmt
        EOT
        id                  = "tf-onboarding/.make/terraform.mk"
        # (8 unchanged attributes hidden)
    }

  # module.repository_tf["onboarding"].github_repository_file.files["Makefile"] will be updated in-place
  ~ resource "github_repository_file" "files" {
      ~ content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
            # File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/tf-all/Makefile
            
            DOCKER_NAME := arrow-tf-onboarding
            
          + include .make/env.mk
          + export
          + 
            help: .help-base .help-cspell .help-markdown .help-editorconfig .help-tf
            
            include .make/base.mk
            include .make/cspell.mk
            include .make/markdown.mk
            include .make/editorconfig.mk
            include .make/terraform.mk
            
            test: cspell-test md-test-links editorconfig-test
        EOT
        id                  = "tf-onboarding/Makefile"
        # (8 unchanged attributes hidden)
    }

Plan: 14 to add, 3 to change, 0 to destroy.

```

</details>

*Pusher: @ServiceDog, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform`*